tests/resources/InvalidCertificateRequest.xml

<?xml version="1.0" encoding="utf-8" ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://tempuri.org/">
    <SOAP-ENV:Body>
        <ns1:ValidaConstancia>
            <ns1:usuario>test</ns1:usuario>
            <ns1:password>test</ns1:password>
            <ns1:constancia>Invalid Certificate</ns1:constancia>
        </ns1:ValidaConstancia>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>